## Plan Result (prod_global)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 1 to change, 4 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hwf-publicapp&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hwf-staffapp&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hwf-publicapp&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hwf-staffapp&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
* Delete
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hwf-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;hwf-staff-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hwf-pet&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;hwf-staff-pet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"
        name                                 = "hmcts-prod"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (11 unchanged attributes hidden)

      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-hwf-pet" -> "healthProbeSettings-hwf-staffapp"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/hwf-pet"
          ~ load_balancing_name = "loadBalancingSettings-hwf-pet" -> "loadBalancingSettings-hwf-staffapp"
          ~ name                = "hwf-pet" -> "hwf-staffapp"

          ~ backend {
              ~ host_header = "helpwithcourtfees.service.gov.uk" -> "staff.helpwithcourtfees.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }
      ~ backend_pool {
          ~ health_probe_name   = "healthProbeSettings-hwf-staff-pet" -> "healthProbeSettings-hwf-publicapp"
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/backendPools/hwf-staff-pet"
          ~ load_balancing_name = "loadBalancingSettings-hwf-staff-pet" -> "loadBalancingSettings-hwf-publicapp"
          ~ name                = "hwf-staff-pet" -> "hwf-publicapp"

          ~ backend {
              ~ host_header = "staff.helpwithcourtfees.service.gov.uk" -> "helpwithcourtfees.service.gov.uk"
                # (6 unchanged attributes hidden)
            }
        }

      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-hwf-pet"
          ~ name                = "healthProbeSettings-hwf-pet" -> "healthProbeSettings-hwf-staffapp"
            # (5 unchanged attributes hidden)
        }
      ~ backend_pool_health_probe {
            id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/healthProbeSettings/healthProbeSettings-hwf-staff-pet"
          ~ name                = "healthProbeSettings-hwf-staff-pet" -> "healthProbeSettings-hwf-publicapp"
            # (5 unchanged attributes hidden)
        }

      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-hwf-pet"
          ~ name                            = "loadBalancingSettings-hwf-pet" -> "loadBalancingSettings-hwf-staffapp"
            # (3 unchanged attributes hidden)
        }
      ~ backend_pool_load_balancing {
            id                              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/loadBalancingSettings/loadBalancingSettings-hwf-staff-pet"
          ~ name                            = "loadBalancingSettings-hwf-staff-pet" -> "loadBalancingSettings-hwf-publicapp"
            # (3 unchanged attributes hidden)
        }

      ~ frontend_endpoint {
          ~ host_name                               = "helpwithcourtfees.service.gov.uk" -> "staff.helpwithcourtfees.service.gov.uk"
            id                                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/hwf-pet"
          ~ name                                    = "hwf-pet" -> "hwf-staffapp"
          ~ web_application_firewall_policy_link_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hwfpetprod" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                               = "staff.helpwithcourtfees.service.gov.uk" -> "helpwithcourtfees.service.gov.uk"
            id                                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/hwf-staff-pet"
          ~ name                                    = "hwf-staff-pet" -> "hwf-publicapp"
          ~ web_application_firewall_policy_link_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hwfstaffpetprod" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hwf-pet",
              + "hwf-staffapp",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/hwf-pet"
          ~ name               = "hwf-pet" -> "hwf-staffapp"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "hwf-pet" -> "hwf-staffapp"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hwf-staff-pet",
              + "hwf-publicapp",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/hwf-staff-pet"
          ~ name               = "hwf-staff-pet" -> "hwf-publicapp"
            # (3 unchanged attributes hidden)

          ~ forwarding_configuration {
              ~ backend_pool_name                     = "hwf-staff-pet" -> "hwf-publicapp"
                # (5 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hwf-pet",
              + "hwf-staffapp",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/hwf-petHttpsRedirect"
          ~ name               = "hwf-petHttpsRedirect" -> "hwf-staffappHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hwf-staff-pet",
              + "hwf-publicapp",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/hwf-staff-petHttpsRedirect"
          ~ name               = "hwf-staff-petHttpsRedirect" -> "hwf-publicappHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (290 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["hwf-pet"] will be destroyed
  # (because key ["hwf-pet"] is not in for_each map)
  - resource "azurerm_frontdoor_custom_https_configuration" "https" {
      - custom_https_provisioning_enabled = true -> null
      - frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/hwf-pet" -> null
      - id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/customHttpsConfiguration/hwf-pet" -> null

      - custom_https_configuration {
          - azure_key_vault_certificate_secret_name = "helpwithcourtfees-service-gov-uk" -> null
          - azure_key_vault_certificate_vault_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsprod" -> null
          - certificate_source                      = "AzureKeyVault" -> null
          - minimum_tls_version                     = "1.2" -> null
          - provisioning_state                      = "Enabled" -> null
          - provisioning_substate                   = "CertificateDeployed" -> null
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["hwf-publicapp"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/hwf-publicapp"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["hwf-staff-pet"] will be destroyed
  # (because key ["hwf-staff-pet"] is not in for_each map)
  - resource "azurerm_frontdoor_custom_https_configuration" "https" {
      - custom_https_provisioning_enabled = true -> null
      - frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/hwf-staff-pet" -> null
      - id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/customHttpsConfiguration/hwf-staff-pet" -> null

      - custom_https_configuration {
          - certificate_source    = "FrontDoor" -> null
          - minimum_tls_version   = "1.2" -> null
          - provisioning_state    = "Enabled" -> null
          - provisioning_substate = "CertificateDeployed" -> null
        }
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["hwf-staffapp"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/hwf-staffapp"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hwf-pet"] will be destroyed
  # (because key ["hwf-pet"] is not in for_each map)
  - resource "azurerm_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [
          - "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourcegroups/lz-prod-rg/providers/Microsoft.Network/frontdoors/hmcts-prod/frontendendpoints/hwf-pet",
        ] -> null
      - id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hwfpetprod" -> null
      - location                          = "global" -> null
      - mode                              = "Prevention" -> null
      - name                              = "hwfpetprod" -> null
      - resource_group_name               = "lz-prod-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null

      - managed_rule {
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hwf-publicapp"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "hwfpublicappprod"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookie_setting"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_fr-staffapp_session"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "address_lookup_url"
            }
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hwf-staff-pet"] will be destroyed
  # (because key ["hwf-staff-pet"] is not in for_each map)
  - resource "azurerm_frontdoor_firewall_policy" "custom" {
      - custom_block_response_status_code = 0 -> null
      - enabled                           = true -> null
      - frontend_endpoint_ids             = [
          - "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourcegroups/lz-prod-rg/providers/Microsoft.Network/frontdoors/hmcts-prod/frontendendpoints/hwf-staff-pet",
        ] -> null
      - id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/hwfstaffpetprod" -> null
      - location                          = "global" -> null
      - mode                              = "Prevention" -> null
      - name                              = "hwfstaffpetprod" -> null
      - resource_group_name               = "lz-prod-rg" -> null
      - tags                              = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/azure-platform-terraform"
          - "businessArea" = "CFT"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null

      - managed_rule {
          - type    = "DefaultRuleSet" -> null
          - version = "1.0" -> null
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["hwf-staffapp"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "hwfstaffappprod"
      + resource_group_name   = "lz-prod-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "IPMatchWhitelist"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "81.134.202.29/32",
                  + "51.145.6.230/32",
                  + "194.33.192.0/25",
                  + "194.33.196.0/25",
                  + "51.145.4.100/32",
                  + "157.203.176.139/32",
                  + "157.203.176.138/32",
                  + "157.203.176.140/32",
                  + "157.203.176.190/32",
                  + "157.203.176.191/32",
                  + "157.203.176.192/32",
                  + "51.149.249.32/27",
                  + "51.149.249.0/27",
                  + "20.108.187.55/32",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "IPMatch"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "cookie_setting"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_fr-staffapp_session"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_ga"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gat"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "_gid"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "fr_username"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "homepage_visited_timestamp"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "address_lookup_url"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "authenticity_token"
            }
        }
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1747,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->